package com.smnadim21.bdarchilogy;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.app.Activity;
import android.app.Dialog;
import android.content.Intent;
import android.net.Uri;
import android.os.Bundle;
import android.view.View;
import android.view.Window;
import android.widget.Button;
import android.widget.LinearLayout;
import android.widget.TextView;
import android.widget.Toast;

import com.google.firebase.database.FirebaseDatabase;
import com.smnadim21.bdarchilogy.adapter.TopicsAdapter;

import java.util.ArrayList;
import java.util.List;

public class ItemListActivity extends AppCompatActivity {

    private RecyclerView recyclerView;
    private RecyclerView.Adapter mAdapter;
    private RecyclerView.LayoutManager layoutManager;
    List<CatItem> myDataset = new ArrayList<>();

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_item_list);



        myDataset.add(new CatItem(
                "ষাট গম্বুজ মসজিদ",
                "ষাট গম্বুজ মসজিদ বাংলাদেশের বাগেরহাট জেলার দক্ষিণ-পশ্চিমে অবস্থিত একটি প্রাচীন মসজিদ। মসজিদটির গায়ে কোনো শিলালিপি নেই। তাই এটি কে নির্মাণ করেছিলেন বা কোন সময়ে নির্মাণ করা হয়েছিল সে সম্বন্ধে সঠিক কোনো তথ্য পাওয়া যায় না। তবে মসজিদটির স্থাপত্যশৈলী দেখলে এটি যে খান জাহান আলী নির্মাণ করেছিলেন সে সম্বন্ধে কোনো সন্দেহ থাকে না। ধারণা করা হয় তিনি ১৫শ শতাব্দীতে এটি নির্মাণ করেন। এ মসজিদটি বহু বছর ধরে ও বহু অর্থ খরচ করে নির্মাণ করা হয়েছিল। পাথরগুলো আনা হয়েছিল রাজমহল থেকে। এটি বাংলাদেশের তিনটি বিশ্ব ঐতিহ্যবাহী স্থানের একটির মধ্যে অবস্থিত; বাগেরহাট শহরটিকেই বিশ্ব ঐতিহ্যবাহী স্থানের মর্যাদা দেওয়া হয়েছে। ১৯৮৩ খ্রিষ্টাব্দে ইউনেস্কো এই সম্মান প্রদান করে।\n" +
                        "\n" +
                        "মসজিদটি উত্তর-দক্ষিণে বাইরের দিকে প্রায় ১৬০ ফুট ও ভিতরের দিকে প্রায় ১৪৩ ফুট লম্বা এবং পূর্ব-পশ্চিমে বাইরের দিকে প্রায় ১০৪ ফুট ও ভিতরের দিকে প্রায় ৮৮ ফুট চওড়া। দেয়ালগুলো প্রায় ৮·৫ ফুট পুরু।",
                "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Sixty_Dome_Mosque%2CBagerhat.jpg/1920px-Sixty_Dome_Mosque%2CBagerhat.jpg",
                "খুলনা, বাগেরহাট"));


        myDataset.add(new CatItem(
                "পাহাড়পুর বৌদ্ধ বিহার",
                "নওগাঁ জেলার বদলগাছী উপজেলায় পাহাড়পুর বৌদ্ধ বিহার অবস্থিত। এটি সোমপুর বিহার নামে পরিচিত। বিহারটি পাল রাজা ধর্মপাল ৭ম শতকে নির্মাণ করেছিলেন। এই বৌদ্ধবিহারটিতে মন্দির, স্ত্তপ, পরিবেষ্টিত বিহারসহ বৌদ্ধ স্থাপনার বেশকিছু নিদর্শন রয়েছে।  বিহারটি ১৯৮৫ সালে ইউনেস্কো কর্তৃক বিশ্ব সাংস্কৃতিক ঐতিহ্য হিসেবে ঘোষিত হয়। প্রত্নস্থলটির স্বল্প দূরত্বে সত্যপীরের ভিটা ও পাহাড়পুর জাদুঘর রয়েছে। পোড়ামাটি শিল্পের ফলকসহ স্থাপত্যশৈলীর এক অনন্য নিদর্শন এই বৌদ্ধ বিহারটি।",
                "https://drive.google.com/uc?id=1LRUPQzqctelXqoI8MuN1LTvwcjqHTQOf",
                "বদলগাছী, নওগাঁ"));


        myDataset.add(new CatItem(
                "জগদ্দল বিহার",
                "গরু স্তম্ভ থেকে মাত্র ৫ মাইল উত্তর- পশ্চিমে এর অবস্থান। মাঝারি আকারের উচু এ ঢিবির কোন কোন অংশে  ইটের দেয়ালের পাথুনী অনাবৃত আছে।  এ ছাড়া এর পৃষ্ঠাদেশ অসংখ্য পাটকেল ও বহুদূর বিস্তৃত এলাকা  জুড়ে দীঘ- পুঞ্চরীনি দেখা যায়। ১৯৮৪ সালে এস্থান থেকে তিনটি ধ্যানী সূক্ষ্ণ মূর্তি  সম্বলিত কালো পাথরের তৈরি একটি  পটুঠেসের অংশ বিশেষ এবং একটি ছোট আকারের ব্রোঞ্চের ঘন্টার ভগ্নাংশ পাওয়া গেছে।  এ হস্তান্তরযোগ্য প্রত্ননিদর্শণগুলো বর্তমানে পাহাড়পুর জাদুঘর সংরক্ষিত আছে। এবং আবিষ্কারের সাথে    নন্দীর রামচরিতের বর্ণণা মিলিয়ে পন্ডিতগণ এ ধারণায় উপনীত হয়েছেন যে, এখানে একটি মহাবিহারে ধ্বংসবশেষ গচ্ছিত আছে। ঢিবির আকৃতি দৃষ্টে স্পষ্ট অণুনিত এ ঢিবি একটি বিহারের ধ্বংসাবশেষ । এ বিহারটি একাদশ দ্বাদশ  শতকে পাল বংশের রাজা রামপাল  কর্তৃক নির্মিত হয়েছিল। অচিরেই এখানে প্রত্নতাত্ত্বিক খনন পরিচালনা করা আবশ্যক। ",
                "https://drive.google.com/uc?id=1gARo5fWZUtuK7FVyooRxE652SFyCUb-d",
                "বদলগাছী, নওগাঁ"));


        myDataset.add(new CatItem(
                "মহাস্হানগড়",
                "মহাস্থানগড় দুর্গ নগরীর প্রাচীরের অদূরে করতোয়া নদীর তীরে অবস্থিত গোবিন্দ ভিটা নামক একটি অসমতল ঢিবিতে প্রত্নতাত্ত্বিক খনন চালিয়ে ২০০/১২৫’ পরিমাপের একটি মন্দিরের ধ্বংসাবশেষ আবিষ্কৃত হয়েছে।  এখানে প্রাপ্ত বিভিন্ন হস্তান্তরযোগ্য প্রত্ননিদর্শণ, ইটের মাপ ব্যবহৃত মসল্লা, স্থাপত্যিক বির্নাস ইত্যাদির ভিত্তিতে অনুমিত  হয় যে, মন্দিরটি খ্রীষ্ঠীয় আনুমানিক সাত শতকে নির্মিত হয়েছিল।  মন্দিরটিতে একাধিকবার পুনঃনির্মানের নিদর্শণ লক্ষ্য করা যায়।",
                "https://drive.google.com/uc?id=1EJ0FIydw3VDKz8rPOe2WVXRn4dJPfsTN",
                "বগুড়া"));

        myDataset.add(new CatItem(
                "গোবিন্দ ভিটা",
                "মহাস্থান শব্দের আভিধানিক অর্থ বিখ্যাত স্থান। কেহ কেহ মনে করেন যে স্থানটির আসল নাম ‘‘মহাস্নান’’ বিখ্যাত স্থানের জায়গা। প্রাচীন পুন্ড্রনগর আজ মহাস্থানগড়ের ভূ-গর্ভে প্রোথিত। এ স্থান বাংলাদেশের সর্বপ্রাচীন নগরীর ধ্বংসাবশেষ। প্রত্নতাত্ত্বিক তথ্য থেকে জানা যায় যে, খৃষ্টপূর্ব ৪র্থ শতক থেকে খৃষ্টিয় ১৫ শ শতকের মধ্যে এই নগর এক সমৃদ্ধশালী জনপদরূপে গড়ে উঠেছিল। করতোয়া নদীর পশ্চিম তীরের এই প্রাচীন নগরের ধ্বংসাবশেষ বর্তমান বগুড়া জেলার এক গৌরবোজ্জল কীর্তি।\n" +
                        "The Ancient Monument Preservation Act-1904 অনুযায়ী ১৯১৯ সালে প্রাচীর বেষ্টিত দুর্গনগরী ও এর শহরতলীর ৪০টি প্রাচীন ঢিবিকে ‘‘সংরক্ষিত পুরাকীর্তি’’ হিসাবে ঘোষণা করা হয়।\n" +
                        " \n" +
                        "কিভাবে যাবেন\n" +
                        "বগুড়া শহর থেকে প্রায় ১৬ কি.মি. উত্তরে অবস্হিত । বগুড়া শহর থেকে বাসে অথবা অটোরিক্সা মহাস্হানগড় যাওয়া যায় । মহাস্হাগড়বাস  বাসষ্ট্যান্ড ১ কি.মি উত্তরে মহাস্হান জাদুঘর । রিক্সায় ১০ টাকার ভাড়া । দর্শনাথী ইচ্ছা করলে পায়ে  হেঁটেও মহাস্হানগড় জাদুঘর দেখতে যেতে  পারেন।\n",
                "https://drive.google.com/uc?id=1cjvYLqeMPoBtTSLLAPHZ7SFaXN24hrjO",
                "বগুড়া"));

        myDataset.add(new CatItem(
                "ছোট সোনা মসজিদ",
                "চাঁপাইনবাবগঞ্জ জেলার শিবগঞ্জ থানার ছোট সোনা মসজিদ অবস্থিত। এই মসজিদ মুসলিম আমলের স্থাপত্য শিল্পের এক অপূর্ব নিদর্শন। মসজিদের শিলালিপির বামদিকের উপর ও নিচের কোণ ভেঙ্গে যাওয়ায় মসজিদের নির্মাণ সাল পাওয়া যায়নি। তবে জানা যায় যে, সুলতান হোসেন শাহর আমলে আলীর পুত্র মজালিশ-ই-মসলিস ও মজালিস-ই-মনসুর ওয়ালী মোহাম্মদ কর্তৃক মসজিদ নির্মিত হয়েছিল ১৪৯৩ থেকে ১৫১৯ খ্রিস্টাব্দের মধ্যবর্তী কোন এক সনের রজব মাসের ১৪ তারিখ। মজজিদটির বাইরের দেয়ালে পাথরের কারুকার্য রয়েছে। বাংলাদেশের প্রস্তর শিল্পের অনন্য নিদর্শন এই মসজিদটি।" +
                        "বগুড়া শহর থেকে প্রায় ১৬ কি.মি. উত্তরে অবস্হিত । বগুড়া শহর থেকে বাসে অথবা অটোরিক্সা মহাস্হানগড় যাওয়া যায় । মহাস্হাগড়বাস  বাসষ্ট্যান্ড ১ কি.মি উত্তরে মহাস্হান জাদুঘর । রিক্সায় ১০ টাকার ভাড়া । দর্শনাথী ইচ্ছা করলে পায়ে  হেঁটেও মহাস্হানগড় জাদুঘর দেখতে যেতে  পারেন।\n",
                "https://drive.google.com/uc?id=1imlCLDpLGarhzh-i-diHnnOu8DhpJhCD",
                "শিবগঞ্জ, চাঁপাইনবাবগঞ্জ"));

        myDataset.add(new CatItem(
                "জোড় বাংলা মন্দির",
                "পাবনা শহরের উত্তর পূর্ব দিকে অবস্থিত ইট নির্মিত জোড় বাংলা মন্দিরটির উপরের পাকা ছাদ বাংলাদেশের অতিপরিচিত দু’টি সংযুক্ত দোচালা ছাদের মত। মন্দিরের সামনের দিকে তিনটি অর্ধবৃত্তাকারের খিলান বিশিষ্ট প্রবশপথ আছে। দরজায় এবং বাইরের দিকে নকশা করা ইটের সুন্দর কারুকাজ রয়েছে। মুর্শিদাবাদের নবাবের তহসিলদার জনৈক ব্রজমোহন ক্রোরী কর্তৃক অষ্টাদশ শতাব্দিতে এই মন্দির নির্মিত হয়েছে বলে জানা যায়।",
                "https://drive.google.com/uc?id=1dxKkY7p6T7YKX8LwL5LYtMTwhNgdUPEM",
                "পাবনা"));

        myDataset.add(new CatItem(
                "রবীন্দ্র কাচারী বাড়ি জাদুঘর",
                "শিলাইদহ রবীন্দ্রনাথ ঠাকুরের স্মৃতিবিজড়িত শিলাইদহ কুঠিবাড়ি । কুষ্টিয়া শহর থেকে ১৫ কিলোমিটার উত্তর পূর্বে কুমারখালি উপজেলার অর্ন্তগত শিলাইদহ ইউনিয়নের খোরেশদপুর কুঠিবাড়ি অবস্হিত ।\n" +
                        " \n" +
                        " রবীন্দ্রনাথের দাদা প্রিন্স দ্বারকানাথ ঠাকুর ১৮০৭ সালে এ অঞ্চলের জমিদারি পান। পরবর্তিতে ১৮৮৯ সালে রবীন্দ্রনাথ ঠাকুর এখানে জমিদার হয়ে আসেন। এখানে তিনি ১৯০১ সাল পর্যন্ত জমিদারী পরিচালনা করেন। এ সময় এখানে বসেই তিনি রচনা করেন তার বিখ্যাত গ্রন্থ সোনার তরী, চিত্রা, চৈতালী, ইত্যাদি, গীতাঞ্জলী কাব্যের অনুবাদ কাজও শুরু করেন ।\n" +
                        "১৯৫৮ সাল থেকে প্রত্নতত্ত্ব অধিদপ্তরের ব্যবস্হাপনায় শিলাইদহ রবীন্দ্রনাথ ঠাকুরের কুঠিবাড়িটি গৌরবময় স্মৃতিরূপে সংরক্ষিত আছে । ১৯৭১ সালে বাংলাদেশ স্বাধীন হওয়ার পর কুঠিবাড়িটি গুরুত্ব অনুধাবন করে কবির বিভিন্ন শিল্পকর্ম সংগ্রহপূর্বক একে একটি জাদুঘর হিসেবে প্রতিষ্ঠা করা হয় ।\n" +
                        " \n" +
                        "পুরো ভবনটি এখন জাদুঘর হিসেবে দর্শকদের জন্যে উম্মুক্ত । জাদুঘরের নীচ ও দ্বিতীয় তলায় ১৬টি কক্ষেই কবি রবীন্দ্রনাথ, শিল্পী রবীন্দ্রনাথ, জমিদার রবীন্দ্রনাথ, কৃষক বন্ধু রবীন্দ্রনাথ অর্থাৎ নানা বয়সের বিচিত্র ভঙ্গির রবীন্দ্রনাথের ছবি । বাল্যকাল থেকে মৃতু্শয্যার ছবি পর্যন্ত সংরক্ষিত আছে । তাছাড়াও রয়েছে শিল্পকর্ম এবং তাঁর ব্যবহার্য আসবাবপত্র দিয়ে পরিপাটি দিয়ে সাজানো ।\n" +
                        "কবি ভবনে ব্যবহার্য জিনিসপত্রগুলোর মধ্যে আরো আছে চঞ্চলা ও চপলা নামের দুটো স্পিডবোট, পল্টুন, ৮বেহারা পালকি, কাঠের চেয়ার, টি টেবিল, সোফাসেট, আরাম চেয়ার, পালংক ইত্যাদি প্রয়োজনীয় জিনিস ।\n" +
                        "টিকেট প্রাপ্তিস্থানঃ     \n" +
                        "জাদুঘরের গেটের  পাশেই রয়েছে টিকেট কাউন্টার, জনপ্রতি টিকেট এর দাম পনের টাকা করে, তবে পাঁচ বছরের কম কোন বাচ্চার জন্যে টিকেট এর দরকার পড়েনা। তবে মাধ্যমিক পর্যায়ের শিশু-কিশোরদের জন্য প্রবেশ মুল্যে নির্ধারন করা হয়েছে ৫ টাকা। সার্কভুক্ত বিদেশি দর্শনার্থীর জন্যে টিকেট মূল্য পঞ্চাশ  টাকা এবং অন্যান্য বিদেশী দর্শকদের জন্য টিকেটের মূল্য একশত টাকা করে।\n" +
                        " \n" +
                        "বন্ধ-খোলার সময়সূচীঃ\n" +
                        "গ্রীষ্মকালে সকাল ১০টা থেকে সন্ধ্যা ৬টা পর্যন্ত কেল্লা খোলা থাকে। মাঝখানে দুপুর ১টা থেকে ১.৩০ পর্যন্ত আধ ঘণ্টার জন্যে বন্ধ থাকে। আর শীতকালে সকাল ৯টা থেকে বিকেল ৫টা পর্যন্ত খোলা থাকে। শীতকালেও দুপুর ১টা থেকে ১.৩০ পর্যন্ত বন্ধ থাকে। আর সবসময়ের জন্যেই শুক্রবারে জুম্মার নামাযের জন্যে সাড়ে বারোটা থেকে তিনটা পর্যন্ত বন্ধ থাকে। রবিবার সাধারণ ছুটি এবং সোমবার বেলা  ২.০০ থেকে   খোলা থাকে। এছাড়াও সরকারী কোন বিশেষ দিবসে জাদুঘর থাকে ।\n",
                "https://drive.google.com/uc?id=1hb4vbpvD0AU-x_7cnOu33ABNOM98G2ye",
                "সিরাজগঞ্জ"));


        myDataset.add(new CatItem(
                "কুসুম্বা মসজিদ",
                "মান্দা থানা থেকে ৪ মাইল উত্তর- পশ্চিমে মান্দা  নওগাঁ সড়কের পশ্চিম পার্শ্বে এ মসজিদটি অবস্থান। এ মসজিদের পূর্বদিকে একটি উত্তর- দক্ষিণে লম্বা দীঘি আছে।  আয়তাকার ৫৮/৫২ ভূমি পরিকল্পনায় নির্মিত এ মসজিদের ছাদ ছয়টি গম্বুজ দ্বারা আচছাদিত। দেয়ালগুলো ৬’-০’’ প্রস্থ। প্রতি কোনে রয়েছে একটি করে অষ্ঠাকৌণিক বুরুজ। এর প্রতিটি  খিলান- দরজা এবং মিহরাবের মুখ ঘাট কাটা। এ মসজিদের দেয়ালের উভয়মুখ প্রস্তর দ্বারা আবৃত। এ মসজিদে লাগানো একটি শিলালিপি থেকে জানা যায় যে, মসজিদটি সুলতান গিয়াসউদ্দিন বাহাদুর শাহেরশাসনামলে জনৈক সোলায়মান কর্তৃক ১৫৫৮ খ্রীষ্টাদ্বে নির্মিত হয়েছিল। ",
                "https://drive.google.com/uc?id=1E4xyjAO6MAr4jNrs4pyNnv3s14YvJxyp",
                "মান্দা, নওগাঁ"));

        myDataset.add(new CatItem(
                "নবরত্ন মন্দির",
                " বগুড়া নগরবাড়ী মহাসড়কের হাটিকুমরুলবাস ষ্ট্যান্ড হতে প্রায় এক কিলোমিটার পূর্বদিকে অবস্থিত হাটিকুমরুল একটি প্রাচীন গ্রাম। এ এলাকা পূর্বে হিন্দু অধ্যষিত ছিল। এখন কয়েকটি হিন্দু পরিবার এখানে বসবাস করার পূর্বে এ গ্রামে হিন্দুদের অনেক প্রাচীন আবাস ইমারত ও মন্দির ছিল। বর্তমানে এখানে ৪ ( চার ) টি হিন্দু মন্দিরের ধ্বংসাবশেষ লক্ষ্য করা যায়। এ চারটি মন্দিরের মধ্যে নবরত্নমন্দিরটি বিশেষভাবে উল্লেখযোগ্য।  বর্গকার পরিকল্পনায়  ( ৫৫’-৭’’) / ৫৫’-৭ নির্মিতি ত্রিতল বিশিষ্ট এ মন্দিরটি একটি উঁচু প্লাটফর্মের উপর অবস্থিত।মন্দিরের ১ম ও ২য় তলার ছাদের চারকোণে চারটি করে ৮ ( আট ) টি চূড়া বেং সর্বশেষ তলার উ পর একটি চূড়া মোট ৯( নয় ) চূড়া বা রত্ন ছিল।  বর্তমানে সব কয়টি চূড়াই বিলুপ্ত। তবে উহাদের ভিতরে কিছু কিছু নিদর্শণ বিদ্যমান। একটি গর্ভগৃহকে কেন্দ্র করে মন্দিরটি ধাপে ধাপে সমম্বয়ে সরু হয়ে উপরে উঠেছে। গর্ভগৃহের চতুপার্শ্বে  আছে টানা বারান্দা। বারান্দার ছাদ বাংলা কুড়ে ঘরের ন্যায় পদ্ধতিতে নির্মিত। নীচ তলার বারান্দাটি উত্তর পূর্ব কোণে একটি ঘূর্নায়মান সিড়ির সাহায্যে মন্দিরের উপর উঠার ব্যবস্থা ছিল। নবরত্ন মন্দিরটি পোড়ামাটির অলংকরণে সমুদ্ধ ছিল। বর্হিদেয়াল ও খিলানের স্তম্ভের কিছু কিছু নিদর্শণ লক্ষ্য করা যায়। নির্মাণ শৈলী, স্থাপত্য বৈশিষ্ট্য ও অলংকরণ দৃষ্টে অণুমিতহয় যে, হাটিকুমরুলসস্থ আলোচ্য নবরত্ন মন্দিরটি উনবিংশ শতকে নির্মিত হয়েছিল। ",
                "https://drive.google.com/uc?id=1Va6BBfJn9LeUHduvD5I2ZLLhm0UGR-Vr",
                "হাটিকুমরুল, নগরবাড়ী, বগুড়া"));




   /*     for( int i = 0 ; i < myDataset.size();i++ )
        {
            FirebaseDatabase.getInstance().getReference()
                    .child("bdArcheology")
                    .child("bdArcheology_" + i)
                    .setValue(myDataset.get(i));
        }
*/

         recyclerView = (RecyclerView) findViewById(R.id.rv_main);

        // use this setting to improve performance if you know that changes
        // in content do not change the layout size of the RecyclerView
        recyclerView.setHasFixedSize(true);

        // use a linear layout manager
        layoutManager = new LinearLayoutManager(this,RecyclerView.VERTICAL,false);
        recyclerView.setLayoutManager(layoutManager);

         mAdapter = new TopicsAdapter(this,myDataset);
         recyclerView.setAdapter(mAdapter);
    }



}
